Revit API Introduction Labs
LabUtils.GetFirstFamilySymbol Method
 Return the first family symbol found in the active document matching the given built-in category or null if none is found.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static FamilySymbol GetFirstFamilySymbol(
	Document doc,
	BuiltInCategory bic
)
Visual Basic (Declaration)
Public Shared Function GetFirstFamilySymbol ( _
	doc As Document, _
	bic As BuiltInCategory _
) As FamilySymbol
Visual C++
public:
static FamilySymbol^ GetFirstFamilySymbol(
	Document^ doc,
	BuiltInCategory bic
)
Parameters
doc
Type: Document
bic
Type: BuiltInCategory
See Also
LabUtils Class
Labs Namespace